ERPDeveloper3/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборРолей</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERPDeveloper3/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ЗаполнитьНаборРолей(ПользовательИБ) Экспорт
	РолиИБ = Метаданные.Роли;
	
	ЭтотОбъект.НаборРолей.Очистить();
	Для Каждого Роль Из РолиИБ Цикл
		СтрокаТЧ = ЭтотОбъект.НаборРолей.Добавить();
		СтрокаТЧ.ИмяРоли 			= Роль.Имя;
		СтрокаТЧ.ПредставлениеРоли 	= Роль.Синоним;
		СтрокаТЧ.Активна 			= ПользовательИБ.Роли.Содержит(Роль);
	КонецЦикла;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Наименование);
	
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя 			= ЭтотОбъект.Наименование;
		ПользовательИБ.ПолноеИмя 	= ЭтотОбъект.ПолноеИмя;		
	КонецЕсли;
	
	ПользовательИБ.Роли.Очистить();
	АктивныеРоли = ЭтотОбъект.НаборРолей.НайтиСтроки(Новый Структура("Активна", Истина));
	
	Для Каждого СтрокаТЧ Из АктивныеРоли Цикл
		ТекРоль = Метаданные.Роли.Найти(СтрокаТЧ.ИмяРоли);		
		ПользовательИБ.Роли.Добавить(ТекРоль);
	КонецЦикла;
	
	ПользовательИБ.Записать();
КонецПроцедуры
